"use strict";

let number = prompt("Введіть число яке треба піднести в квадрат", "");
alert(number ** 2);

let name = prompt("Введіть ім'я", "");
let x = prompt("Введіть суму депозиту", "");
let n = prompt("Введіть на скількі місяців депозит", "");
let s = ((x * 20) / 100 / 12) * n;
alert(`Шановний ${name} , Ви внесли ${x} грн. , під 20% річних, на термін ${n} місяців.
  За цей час періоду Ви заробите ${s} грн.`);

let a = prompt("Введіть число a", "");
let b = prompt("Введіть число b", "");
alert(`Сума     ${+a + +b},
Різниця  ${a - b},
Множення ${a * b},
Ділення  ${a / b}`);
